#include <iostream>
#include <cmath> 

int main() {
    double x, A, B, y;

    // Введення значення x
    std::cout << "x =  ";
    std::cin >> x;

    // Обчислення сталої частини виразу A
    A = fabs(4 * x - 1); // модуль

    // Спосіб 1: розгалуження в скороченій формі
    if (x < 0) {
        B = pow(x, 7) - 2 * x;  // вираз1
    }
    else if (x >= 0 && x < 3) {
        B = atan((exp(x) + 1) / 8);  // вираз2
    }
    else {
        B = pow(x, 4) + exp(x * x + 3);  // вираз3
    }

    // Обчислення значення y
    y = A + B;

    // Виведення результату
    std::cout << "y = " << y << std::endl;

    // Спосіб 2: розгалуження в повній формі
    if (x < 0) {
        B = pow(x, 7) - 2 * x;  // вираз1
    }
    else {
        if (x >= 0 && x < 3) {
            B = atan((exp(x) + 1) / 8);  // вираз2
        }
        else {
            B = pow(x, 4) + exp(x * x + 3);  // вираз3
        }
    }

    // Обчислення значення y для другого способу
    y = A + B;

    // Виведення результату для другого способу
    std::cout << "y2 = " << y << std::endl;

    return 0;
}